<template>
  <div class="about">
    <h2>
      このシステムについて
    </h2>
      <h3>
        サイネージ
      </h3>
        <p>
          IoTやユビキタスコンピューティングが進み、スマートシティの実現が視野に入ってくると、公共空間での情報提示手段の重要性がより深く認識されるようになってきます。そこで本研究室では、キャンパスに設置するという前提のもとで、コンテクストアウェアな情報提示を可能とするデジタルサイネージのプロトタイプを開発しました。
        </p>
      <h3>
        特徴
      </h3>
        <p>
          本サイネージでは、データベースにデータを置くだけで自動でパネルを表示できるため、容易に機能を拡張することができます。そのため、容易に表示する情報を切り替えることができ、コンテクストに合わせた柔軟な運用が可能となります。
        </p>
      <h3>
        機能例
      </h3>
        <ul>
          <li>
            <h4>各種情報</h4>
            <p>様々な機関が公開しているapiから得た情報をデータベースにポストするプログラムを書けば簡単に表示する情報を追加することができます。</p>
          </li>
          <li>
            <h4>多言語対応</h4>
            <p>カードをかざすだけで表示言語を切り替えることができます。</p>
          </li>
          <li>
            <h4>ワードクラウド</h4>
            <p>マイクからの入力を元に、今サイネージの近くで話されていることを可視化します。</p>
          </li>
          <li>
            <h4>スマートペイメントを用いた広告サービス</h4>
            <p>表示領域の空いたスペースに広告を表示することができます。登録はスマートフォンやタブレットから簡単に行えます。決済には当研究室で開発した仮想通貨、UTCoinを用います。</p>
          </li>
        </ul>
  </div>
</template>

<script>
export default {
  name: 'about'
}
</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style lang="scss" scoped>
.about {
  text-align: left;
  font-size: 3.5rem;
  padding: 1vw
}
</style>
